using System.Text.RegularExpressions;
using Microsoft.Extensions.Localization;
using WebUIVanilla.Client.Constants;
using WebUIVanilla.Shared.Resources;

namespace WebUIVanilla.Client.Validator;

public class NameValidator : INameValidator
{
    private IStringLocalizer<Resource> _localizer;

    private const string JpKanji = @"一乙丶丿亅" +
                             "九七十人丁刀二入" +
                             "乃八卜又了力乂亠儿冂冖冫几凵勹" +
                             "匕匚匸卩厂厶廴" +
                             "下干丸久及弓巾" +
                             "己乞口工叉才三山士子勺女小上丈" +
                             "刃寸千川大土之亡凡万巳也夕与个" +
                             "于兀刄囗夂夊孑宀尢尸屮巛已幺广" +
                             "廾弋彑彡彳" +
                             "以井允引丑云円王化" +
                             "火牙介刈瓦仇牛巨凶斤区欠月犬元" +
                             "幻戸五互午公勾孔今支止氏尺手収" +
                             "什升少冗心仁壬水切双太丹中弔爪" +
                             "天斗屯内匂廿日巴反比匹不夫父仏" +
                             "分文片方乏毛木勿尤匁厄友予六弌" +
                             "丐亢从仍仄仆仂兮卆卅卍卞夬夭尹" +
                             "乢弖戈扎攴攵无旡曰歹殳毋气爻爿" +
                             "辷" +
                             "圧印右卯瓜永凹央加可禾外且" +
                             "叶刊甘丘旧去叫玉句兄穴玄乎古功" +
                             "巧広弘甲号込左冊札皿仕仔司史四" +
                             "市示叱失写主囚汁出処召尻申世正" +
                             "生斥石仙占匝他打代台凧只叩旦庁" +
                             "辻汀田奴冬凸乍尼白半氾犯皮疋必" +
                             "氷付布弗払丙平辺弁戊母包北本末" +
                             "未民矛目矢由幼用立令礼丕丱丼弍" +
                             "仗仞仭仟囘册冉刋匆丗卉卮夘叮叨" +
                             "叭叺圦夲孕它尓屶戉朮癶艾阡" +
                             "旭" +
                             "扱安伊夷衣亥芋因吋宇羽迂臼曳延" +
                             "汚仮会回灰各汗缶企伎危机気吉吃" +
                             "休吸朽汲兇共匡仰曲祁刑圭血件伍" +
                             "交光向后好江考行合此艮再在冴阪" +
                             "旨死糸至似字寺次而耳自汐式芝邪" +
                             "守朱州舟充戎夙旬巡匠庄丞色臣尽" +
                             "迅成西舌先尖舛全壮早争存多宅托" +
                             "辿団地弛池竹仲虫兆吊廷伝吐灯当" +
                             "同那凪汝弐肉如任年肌伐帆汎妃百" +
                             "伏米邦忙防朴毎亦迄牟名牝妄有羊" +
                             "吏両列劣老肋亙亘价伉伜决冱冲冰" +
                             "凩刔刎匈吁圷圸夛夸奸妁屹岌幵并" +
                             "忖戍戌扞扣扛扠扨攷收朿朶杁朸朷" +
                             "汕汢犲网耒聿艸芍芒虍襾赱邨阨阮" +
                             "阯" +
                             "亜阿芦杏位囲医壱応沖牡何伽" +
                             "花我芽快戒改芥貝角苅完肝含岐希" +
                             "忌汽妓技却求灸究拒亨狂局均芹近" +
                             "吟玖串君形系芸迎決見言呉吾坑孝" +
                             "宏抗攻更劫克告困佐沙坐災材坂作" +
                             "伺姉志孜私児宍社車杓灼寿秀住初" +
                             "助序床抄肖条杖状伸芯身辛図吹杉" +
                             "声赤折阻宋走即束足村汰妥陀体対" +
                             "択沢但辰谷男町沈佃低呈弟邸兎杜" +
                             "努投豆禿酉沌呑尿妊忍把芭売伯麦" +
                             "抜伴判釆否庇批尾肘扶芙附吻扮兵" +
                             "別返甫呆芳坊妨忘吠没妙免杢戻冶" +
                             "役佑邑余妖抑沃来乱卵利李里良伶" +
                             "冷励呂労弄牢亊佚估佛佝佗佇兌冏" +
                             "况刧刪劬劭甸匣吽呀听吭吼吮吶吩" +
                             "吝呎囮坎圻址坏壯夾妝佞妣妍孚孛" +
                             "斈尨屁岑岔妛巫巵帋廸弃彷忻忤忸" +
                             "忱忰扼抂抉找抒抓抖抃抔抛攸旱曵" +
                             "杆杞杠杙杣杤汞汪沂沍沚沁沛汾汨" +
                             "汳沒沐泛犹狃狆狄瓧瓩甬甼疔皀皃" +
                             "矣祀竍糺罕羌肛肓肚芫芟芬苡苣乕" +
                             "豕豸迚邯邱邵陂" +
                             "宛姐或依委易育" +
                             "郁雨泳英奄沿炎苑於往押旺欧殴岡" +
                             "価佳果河苛茄迦画臥廻怪拐劾拡学" +
                             "岳茅侃官岸玩岩奇祈季宜祇杵泣糾" +
                             "居拠享京供侠協怯況尭欣金狗苦具" +
                             "空屈沓卦径茎券建肩弦限呼固姑孤" +
                             "弧狐股虎佼効幸庚拘昂杭肯肱郊降" +
                             "刻国忽狛坤昏昆些妻采肴咋刷参使" +
                             "刺始枝祉肢事侍治竺実舎者若取受" +
                             "呪周宗叔述所妾尚承招昇昌松沼垂" +
                             "炊枢制姓征性青斉昔析拙浅岨狙卒" +
                             "其岱苔卓拓坦担知宙忠抽注苧帖長" +
                             "直坪定底抵泥的迭典店妬宕東到届" +
                             "苫奈迩乳念廼杷波拝杯肺拍泊迫函" +
                             "板版卑彼披泌肥非枇表苗府怖斧阜" +
                             "武服沸物併並歩奉宝庖抱放朋法泡" +
                             "房肪牧奔妹枚枕抹沫侭味岬命明茂" +
                             "孟盲門夜耶弥油林例怜苓炉郎和枠" +
                             "乖亞亟佶侈侏侘佻佩佰侑佯來侖兒" +
                             "兔兩冽凭刮刳刹劼劵卷咏呵咎呟呱" +
                             "呷咒呻咀呶咄咐咆咼囹坩垈坡坿垉" +
                             "侫妲姆孥屆岫岻岶岼岷峅岾帚帙帑" +
                             "帛弩徃徂彿忝忿怡怙怐怩怛怕怫怦" +
                             "怏怺戔拔拗拑抻拆拈拌拊拂拇拉抬" +
                             "杲昊昃旻杳枉杰枩杼杪枌枋枦枡枅" +
                             "歿殀毟氓氛泄泱泓沽泗泅泝沮沱沾" +
                             "沺泯泙泪炙炒炬爭爬牀狎狒瓮瓲瓰" +
                             "畄疚疝盂矼秉穹竏籵罔肭冐肬臾舍" +
                             "苟苒苴苳苺苻苹苞茆苜茉苙虱衫軋" +
                             "迥迢迪迯陌陏陋隶隹鼡" +
                             "娃哀姶茜" +
                             "虻按威為畏胃茨咽姻胤院姥荏映栄" +
                             "洩盈疫怨屋卸音科架珂俄恢界皆咳" +
                             "垣柿革恰括活冠巻姦柑看竿陥既紀" +
                             "軌鬼客虐逆急笈級峡挟狭粁衿矩粂" +
                             "軍郡係型契荊計研県故枯胡後侯厚" +
                             "垢巷恒洪皇紅荒香拷骨恨差査砂哉" +
                             "砕咲削昨柵拶珊残姿屍思指施持室" +
                             "狩首修拾洲秋酋柔重祝俊春盾叙除" +
                             "将昭省乗城浄拭食信侵神甚陣帥是" +
                             "政星牲窃宣専泉洗染穿前祖奏相草" +
                             "荘送促則俗柁耐待怠胎退茸単炭胆" +
                             "段茶昼柱挑勅珍津追栂柘亭剃貞帝" +
                             "庭挺訂点度怒逃洞峠毒独栃突南虹" +
                             "祢蚤派盃背矧柏畑発叛飛毘眉美柊" +
                             "彦姫秒品負赴侮封風柄陛頁変便勉" +
                             "保胞某冒勃殆盆昧柾俣迷姪面籾約" +
                             "柳勇宥幽柚祐洋要洛律侶亮厘玲歪" +
                             "亰俔俟俎俘俛俑俚俐俤俥兪冑凾剏" +
                             "剄剋剌勁匍卻厖叟呰哇咢咸咥咬哄" +
                             "哈咨咫哂咤咾哘咯圀囿垓垠垳垤垪" +
                             "垰竒奕奐奎姨姜姙姚娜孩宦屎屏峇" +
                             "峙庠弭弯彖徊很徇恠怎怱恪恟恊恆" +
                             "恍恃恤恂恬恫扁拏拜挌拮拱挧挂拯" +
                             "拵畋斫昵昶昴昜昿曷朏枷柯枴柬枳" +
                             "柩枸柤柞柝柢柮枹柎柆柧殄殃洟衍" +
                             "洶洫洽洸洙洵洳洒洌涎炯炸炳炮爰" +
                             "爼牴狢狠狡珈玳珎玻珀瓱畍畊畉畆" +
                             "疥疣癸皈盻眈眇眄矜砌砒祠祗祚祕" +
                             "祓禹禺秕秬穽竕竓笂紆紂缸罘胛胥" +
                             "胙胝胄胚胖脉舁范茵茴茖茲茱荀茹" +
                             "荐荅茯茫茗茘莚衂衵衽衲袂訃赳迴" +
                             "逅迹迺迸郢郤郛酊閂陜陞陝陟陦韋" +
                             "韭鳬" +
                             "唖挨逢案員陰烏唄浦益悦宴" +
                             "翁荻俺恩夏家荷華蚊峨悔海害浬格" +
                             "核郭株釜栢桓莞帰記起飢桔砧宮挙" +
                             "卿恐恭胸脅郷桐倶屑栗桑訓珪恵桂" +
                             "桁倹倦健兼剣拳軒険原個庫娯悟候" +
                             "倖晃校浩紘耕航貢砿高剛根唆座挫" +
                             "宰栽剤財朔窄索桜殺捌晒桟蚕師紙" +
                             "脂時疾柴射紗借酌弱殊珠酒臭従峻" +
                             "准殉純書徐恕哨宵消症祥称笑辱唇" +
                             "娠振晋浸疹真秦針訊逗粋衰畝凄栖" +
                             "逝脆隻席脊扇栓栴閃租素倉捜挿造" +
                             "息捉速袖孫帯泰託狸耽値恥致畜逐" +
                             "秩衷酎凋捗朕陳通悌逓釘哲展徒途" +
                             "都砥砺倒党凍唐套島桃涛討透陶胴" +
                             "匿涜特悩納能破馬俳配倍狽陪這秤" +
                             "剥莫畠隼班畔般挽匪疲秘被畢桧紐" +
                             "俵豹病浜瓶浮部粉紛娩圃捕倣俸峰" +
                             "峯砲剖紡埋哩桝脈粍眠務娘冥耗紋" +
                             "涌郵容浴莱陸流留竜旅凌料陵倫涙" +
                             "烈恋連朗浪狼倭脇乘亳倚倨倔倪倥" +
                             "倅俶倡倩倬俾俯們倆偖冓冤冦冢凅" +
                             "凉剞剔勍哥哦唏唔哽哮哭哺哢圄埀" +
                             "埃埆埔埒埓埖奚奘娥娟娑娉娚婀宸" +
                             "尅屓屐峩峽峺峭峪崋弉徑恚恁恷恣" +
                             "恙悁悍悃悚悄悛悖悗悒悧悋拿挈捐" +
                             "挾捍捏效敖旃旆旁旄晏晄晉晁晟栞" +
                             "框栩桀桍栲桎栫桙档條梛梃梠殷氤" +
                             "氣浣涓浤浚浹浙涕涅烟烋烝烙狹狷" +
                             "倏珥珮珞珱瓷畛畚痂疳痃疽疸疼疱" +
                             "皋皰盍眩眤眞眛砠祟秧秡秣窈站竚" +
                             "竝笏笊笆笄笋粃粐紜紕紊缺罟罠羔" +
                             "羞翅翆耆耄耘耙耿耻胯胱脩胼舐舩" +
                             "舫舮芻莓莅莪莟莢莖茣莎莇莊荼莵" +
                             "荳荵莠莉莨莽虔蚓蚣蚩蚪蚋蚌衄袁" +
                             "衾袗袒袮袙袢袍訖訐訌豈豺躬逑逕" +
                             "逡逍逞逖逋逧逎釖釟釡釛陷陲陬髟" +
                             "鬥鬯鬲" +
                             "悪梓袷庵偉尉惟異移萎域" +
                             "逸淫渦厩営液掩焔黄桶菓貨過晦械" +
                             "階崖涯蛎殻掛笠梶渇椛兜乾勘患敢" +
                             "貫眼基寄規亀偽掬菊脚救球渠虚許" +
                             "距魚強教菌躯偶隅釧掘隈袈啓掲渓" +
                             "畦経蛍訣堅捲牽現絃舷袴菰梧康控" +
                             "梗黒惚頃婚梱混痕紺彩採済砦祭斎" +
                             "細菜崎埼笹匙皐惨産斬視痔鹿雫執" +
                             "悉偲捨赦斜蛇釈寂授終習週渋宿淑" +
                             "粛術淳渚庶商唱娼捷梢渉章紹菖訟" +
                             "象剰常情埴深紳進笥推酔随崇据菅" +
                             "雀清盛惜戚責接設雪旋船措曽粗組" +
                             "爽掃掻曹巣窓側族唾堕舵堆袋逮隊" +
                             "第啄脱探淡蛋断窒着猪著帳張彫眺" +
                             "頂鳥掴壷紬釣停偵梯笛添甜転堵屠" +
                             "菟悼梼盗淘祷動堂萄得寅惇豚捺軟" +
                             "猫捻粘埜脳婆排敗培梅粕舶販菱彪" +
                             "票描彬貧敏埠婦冨符副閉偏菩崩捧" +
                             "烹萌訪望釦堀麻密猛問野訳唯悠庸" +
                             "陽欲翌淀梨理率掠略琉粒隆梁涼猟" +
                             "淋累婁廊偃假偕偐偈做偬偸傀冕處" +
                             "凰剪剳剱勗匐匏區厠參曼唹啀啌售" +
                             "啜啅啖啗唸唳啝圉圈國堊埣堋堝梦" +
                             "奢婬婉娵娶婢婪孰寃寇寉將專崕崗" +
                             "崟崛崑崔崢崚崙崘帶帷弸彗從徙徘" +
                             "徠惧悸惓悴悽惆悵惘戛掖掎掀掫捶" +
                             "掏掉掟掵捫捩揶敕敍敘敝斛旌晞晝" +
                             "晤晧晨晢朖梳桷桿梟梏梭梔梹桴梵" +
                             "梺梍桾欸欷殍毬毫淹渕渊涵淇淦涸" +
                             "淆淬淞淌淨淒淅淺淙淤淕淪淮渮烱" +
                             "焉烽牾犁猗猊猜猖猝琅珸瓠瓸畩畤" +
                             "畧疵痍痊痒皎盖盒眥眦眷眸硅窕竡" +
                             "笳笘笙笞笵笨笶絅絋紮紲紿紵絆羝" +
                             "羚翊耜聊聆脛脣脯隋舂舸舳菴萓菫" +
                             "菎菽萃菘萋菁菷萇菠菲萍萢萠萸菻" +
                             "萵蚶蚯蛄蛆蚰蛉蚫衒袞袵袤袰袿袱" +
                             "裃裄覓訛訝訥谺豼戝貭貪貮貶赧跂" +
                             "趾趺軛軣逶逵逹扈鄂酖酘釼釵釶閇" +
                             "閊隍隗勒竟馗鹵麥麸" +
                             "葵握渥葦絢" +
                             "粟椅違飲閏運雲瑛詠越堰援甥奥温" +
                             "禍賀雅塊絵開凱慨街蛙鈎覚隔割喝" +
                             "滑葛萱粥寒喚堪換棺款間閑雁喜幾" +
                             "揮期棋棄稀貴欺喫黍給喬暁極欽琴" +
                             "禽筋喰寓遇敬景軽戟隙傑結喧圏検" +
                             "硯減湖雇御喉慌港硬絞腔項嵯詐最" +
                             "犀裁堺策傘散斯紫詞歯滋軸湿屡煮" +
                             "惹就蒐衆集竣舜循順暑勝掌晶湘焼" +
                             "焦硝粧蒋証詔場畳植殖森診尋腎靭" +
                             "須酢厨遂椙晴棲税絶践善然禅曾疏" +
                             "疎訴創喪惣痩葬装測属揃尊詑惰替" +
                             "滞貸琢達巽棚湛短弾智遅筑註貯喋" +
                             "朝脹超椎痛堤提程艇鼎貼渡登塔搭" +
                             "棟湯痘等答筒統董童道敦遁鈍韮葱" +
                             "覗琶廃牌媒買萩博硲筈溌筏蛤斑飯" +
                             "晩番蛮悲扉斐費備琵弼筆逼媛評蛭" +
                             "斌富普葡葺復幅淵焚雰塀遍補募報" +
                             "傍帽棒貿満湊無椋婿棉貰悶爺愉揖" +
                             "湧猶裕遊雄揚揺葉絡落嵐痢裡葎硫" +
                             "量琳塁裂榔禄惑椀湾腕舒傚傅傲剴" +
                             "剩勞飭凖厦厥啣喙喀喊喟啻啾喘喞" +
                             "單啼喃喩喇喨嗟圍堙堡壺壹壻奠媚" +
                             "嫂孳寔寐孱嵜嵌嵒嵎嵋嵬嵳幄幃幀" +
                             "幇廁廂廐弑彭徨悳惡惠愕惶愀惴惺" +
                             "愃愡惻惱愎愧戞搜掣掾揩揀揆揣揉" +
                             "插揄搓敞晰暃暎朞椏椁棊椈棘椢椦" +
                             "棡椌棍棔棧棕椒椄棗棣椥棹棠棯椨" +
                             "椪椚椣椡棆楮椰盜欹殘殕殼毳毯渭" +
                             "湮渙湲湟渾渣湫渫湶湍渟湃渺湎渤" +
                             "渝游溂溲焜焙爲牋犂犇猴猯猩猥猾" +
                             "瑯琥琲琺甦畫畭畴痙痣痞痾發皖皓" +
                             "皴睇硴祺祿稈稍窗窘窖竢竦筐筍筌" +
                             "筅筵筥筬筝粤粭粢粫粡粨絳絖絎絲" +
                             "絨絮絏絣絛絽翕翔耋聒腋腆脾腓腑" +
                             "腱腴葭萪萼蒄葷葫葮蒂葩葆萬葯葹" +
                             "葢蓚蛔蛞蛩蛬蛟蛛蛯蜒蜑裙覃覘觚" +
                             "觝訶詁詛詒詆詈貂貽貳賁趁跏跚跖" +
                             "跌跛跋躰軼軻軫辜遏遐遑遒遉逾遖" +
                             "鄒酣酥釉鈞釿鈔鈬鈕鈑鉅鈩閔閖隘" +
                             "隕雋靫靱颪飩飫馭馮骭黹堯" +
                             "愛飴" +
                             "暗意溢蔭隠碓園煙猿遠鉛塩嫁暇嘩" +
                             "蛾解魁概碍蓋該廓較楽蒲勧寛幹感" +
                             "頑義詰業僅勤禁愚虞窟靴群傾携継" +
                             "罫詣嫌献絹遣源誇跨鈷鼓瑚碁溝鉱" +
                             "腰魂瑳裟債催塞歳載際罪榊碕搾嗣" +
                             "獅詩試資飼慈蒔辞嫉蔀腫愁酬楯準" +
                             "署傷奨照詳鉦障蒸飾触寝慎新睡瑞" +
                             "嵩数裾勢聖誠跡摂節戦煎羨腺詮賎" +
                             "塑楚遡鼠想蒼像賊続損遜楕腿滝蛸" +
                             "竪誕暖痴稚置馳蓄牒腸跳賃槌塚椿" +
                             "碇禎溺鉄填殿電塗塘働督椴頓楢馴" +
                             "畷楠農楳煤漠鉢鳩塙搬煩頒碑微稗" +
                             "蒜楓福腹墓蓬蜂豊飽睦幌幕蓑稔夢" +
                             "盟滅摸蒙靖愈猷誉預傭楊溶蓉遥裸" +
                             "雷酪裏溜虜稜鈴零廉漣煉蓮賂路楼" +
                             "話賄詫碗亂亶會傴僉傳僂剿剽勣勦" +
                             "勠匯嗚嗅嗄嗜嗤嗔嗷嗹圓嗇塢塋塰" +
                             "毀塒堽壼奧媼媾嫋媽嫐寞尠嵶幎廈" +
                             "彁彙徭慍愆惷愍愾慊愼愴愽慄慥戡" +
                             "搖搆搦搶搗搨搏斟旒暈暉暄暘椶楹" +
                             "楷楜楸楫楔楾椹楴椽楙楡楞楝榁楪" +
                             "槐榾槎飮歇歃溪溘滉溷滓溽溯滄滔" +
                             "溏溥滂溟滌漓煥煦煢煌煖煬獏瑕琿" +
                             "瑟瑙瑁瑜瑰甄甃甅甞畸當痿痼瘁痰" +
                             "痺痲痳皙盞睚睨睫睛睥睹矮碎碆硼" +
                             "碚碌禊稘稙稠稟禀窩筺筴筧筰筱筮" +
                             "粳粲粱粮糀經綉綏綛罨罩罧羣耡聘" +
                             "肄肆肅腮腥腦腟舅與艀蒭蓊蒹蒿蒟" +
                             "蓙蓍蒻蓐蓁蓆蓖蒡號蜆蜈蜀蜃蛻蜉" +
                             "蜍蛹蜊衙裔裘裝褂裼裨裲褄觜觧詼" +
                             "詭詬詢誅誂誄諍豢貉貅貊貲賈賍跪" +
                             "跫跟跣躱軾輊輅輌辟遘遞遨鄙酩鉞" +
                             "鉗鉉鉤鉈鈿鉋鉐鉚閘閙閠雎雉雍雹" +
                             "靹韵頏頌骰髢鳧鳰鳫麁黽遙" +
                             "斡綾" +
                             "維稲嘘蔚餌駅榎厭演嘉寡歌箇劃赫" +
                             "閣褐樺鞄慣漢潅監管関旗疑漁僑境" +
                             "緊銀駆窪熊頚語誤構綱膏酵閤豪酷" +
                             "獄漉察雑算酸誌雌爾磁漆遮種綬需" +
                             "銃塾緒嘗彰裳蝕榛塵翠頗摺精製誓" +
                             "静碩説蝉煽銭銑漸僧槍漕総綜聡遭" +
                             "増蔵駄態奪嘆端箪綻蜘嫡徴暢銚墜" +
                             "漬蔦綴鄭摘滴適嶋銅徳読鳶賑認寧" +
                             "箔駁箸肇髪罰閥緋樋鼻漂賓腐舞複" +
                             "聞幣弊蔽碧蔑箆輔慕暮鳳貌鉾僕槙" +
                             "膜慢漫蔓魅箕蜜銘鳴綿模網餅誘様" +
                             "熔踊養璃僚領緑隣瑠暦歴漏蝋僊僖" +
                             "僞僥僭僣僮儁兢冩匱厮厰嘔嘖嗾嗽" +
                             "嘛團圖塲塹墅墟墸墮壽夐夥奬奩嫣" +
                             "嫗嫦嫩嫖孵寤實寢寥對嶌嶇嶄嶂嶐" +
                             "幗幔麼廏廖廣慇愨愿愬慂慳慷慘慚" +
                             "慴慯慱慟慝慓慵截搴摧摶摎敲暝曄" +
                             "榲榮榿槁槓寨槊槝榻槃榧榑榠榜榕" +
                             "榴槞槨榱歉殞毓滿漑滬滸滾滲漱滯" +
                             "漲漾滷潴煕熈熏熄熕熬犒犖瑣瑪瑶" +
                             "甍瘋瘍瘉瘟瘧皸皹盡睿睾碣碵碪碯" +
                             "磆磋禝稱竭竰箝箘箟箍箜箚箋箒箏" +
                             "箙粹粽綺綮綣綵緇綽綫綢綯綸綟綰" +
                             "緕翡聚聟聢膃膈膊膀膂臧臺蔆蔡蓿" +
                             "蓴蔗蔘蔟蔕蔔蓼蜴蜿蜷蜻蜥蜩蜚蝸" +
                             "螂裹裴褌褊褓褞褪褝覡誨誡誑誥誦" +
                             "誚誣貍趙跼踈踉跿輕輒輓辣遯隨鄲" +
                             "鄰酳酲銕銜銖銓銛鋩錚閨閧閭隧霆" +
                             "靤鞅靼鞁靺鞆韶颯颱餃餉馼髣髦魄" +
                             "魃皷齊槇瑤熙" +
                             "鞍慰緯遺噂影衛鋭" +
                             "閲縁横鴎億稼蝦課餓駕骸撹確樫潟" +
                             "噛歓澗緩諌翫嬉毅畿輝儀戯誼窮蕎" +
                             "駈駒勲慶慧稽劇撃潔権賢糊稿麹穀" +
                             "撮撒賛暫賜質蕊趣熟潤遵醇諸鋤廠" +
                             "樟蕉衝賞嘱審震諏澄請撰潜箭線選" +
                             "遷糎噌層槽憎諾誰歎談鋳駐樗潮蝶" +
                             "調槻潰締敵徹撤賭蕩踏導憧撞鴇橡" +
                             "縄熱撚播罵輩賠蝿箱幡範盤磐蕃罷" +
                             "誹膝標廟鋲敷膚賦撫蕪噴墳憤僻篇" +
                             "編舗鋪穂褒鋒暴頬墨撲摩緬黙憂窯" +
                             "慾履劉慮寮諒遼輪霊憐練魯論蕨豫" +
                             "價僵儉儂儚冪凛劍劈匳噎噐嘶嘲嘸" +
                             "墹墫墺嫺嫻嬌嬋寫嶢嶝幟幢幤廝廚" +
                             "廛廢廡彈慙慫憇憬憔憚憫憮懊戮摯" +
                             "撕撓撥撩撈擒撻數暹暼樮樂樛槿槹" +
                             "槲槧樅樞槭樔槫樊樒樣樓橄樌橢樢" +
                             "歐歔殤毆麾滕潁漿澆潺潸澁潯潛潭" +
                             "澂潼潘澎澑潦澳濆熨獎獗瑩瑾璋甌" +
                             "甎瘠瘡瘢瘤皚皺瞎瞋瞑磑磔碾碼磅" +
                             "磊稻稾稷穃窰篋篁篌篏箴篆糅糂緜" +
                             "緘緝緤緞緲緡縅縒縋罸羯羮翦翩聨" +
                             "膠膕膤膣膓膵舖艘蕚蔬蕀蕣蕘蕈蕁" +
                             "蕋蕕蝠蝟蝌蝎蝴蝗蝨蝮蝙蝓蝣蝪褥" +
                             "褫覩諄諂諚諛豌豎豬貎賤賣賚赭踝" +
                             "踞踐踟踪輙輜輟輛輦遶遲邁醋醉醂" +
                             "鋏銹銷錺錵險霄霈靠鞋鞏鞐頡餒餔" +
                             "餘餝駟駛駝駘駑骼髯髫髮髴髱鬧魴" +
                             "鴉鴈鴃鴆麩麪黎齒凜" +
                             "穐鮎謂窺叡" +
                             "穎頴謁燕薗鴛鴬憶穏壊懐獲鴨憾翰" +
                             "還館舘器機橘鋸彊橋興凝錦薫憩激" +
                             "憲鍵厳諺檎醐衡鋼甑墾錯薩錆餐諮" +
                             "鴫篠縞錫儒樹輯醜獣縦薯樵鞘壌嬢" +
                             "錠薪親錐錘整醒積薦膳操醍濁樽壇" +
                             "築諜諦蹄澱燈糖頭篤噸曇薙謎鍋燃" +
                             "濃薄縛醗噺避髭瓢錨頻蕗鮒奮壁瞥" +
                             "縫膨謀穆磨麺薬薮諭輸融擁頼覧龍" +
                             "燐隷錬篭録儘儖儕儔冀劔劒劑辨辧" +
                             "勳勵營嘴噫噤嘯噬噪嚆圜墻壅嬖學" +
                             "寰嶬嶮嶼廨廩彜徼憙憖憊憑懌懈懆" +
                             "憺罹懍戰擔撼據擅擇擂舉旙曁曉暾" +
                             "暸橲樶橸橇橙橦橈樸檠歙殪殫濂澣" +
                             "澡澤澹澪濛燗熹熾燒燉燔燎燠燧燵" +
                             "默獪獨璢璞疂瘴瘰瘻盥盧瞠瞞瞰磬" +
                             "磧磚禧禪窶窿篝篩簑篦篥篳篷糘糒" +
                             "糢緻縊縣縡縟縉縢縺羲耨膩膰臈臻" +
                             "艙薀薤薈薑薊薨蕭薔薛薇薜蕷蕾薐" +
                             "螢螟螯蟇蟆蟒衞襃褶褸覦諫諳諧諤" +
                             "諱謔諠諢諷諞諡蹂踵踰踴蹉躾輳輻" +
                             "輹邂遽邀錏鋺鍄錮錙錢錣錻閼閻閹" +
                             "閾闍隱隲隰霍雕霓霎霑霏霖霙靜靦" +
                             "頸頤頷頽餡餞餤餠駭駮駱駲駢髷髻" +
                             "鬨鮓鮃鮑鮖鮗鴪鴦鴣鴟鴕鴒麈麭黔" +
                             "闇磯嬰襖臆霞嚇橿轄竃環韓癌徽" +
                             "擬犠鞠禦矯櫛鍬繋謙糠講購鴻壕濠" +
                             "懇鮭擦鮫燦謝爵繍縮瞬駿曙償礁醤" +
                             "鍾燭趨績繊鮮燥糟霜戴黛濯鍛檀聴" +
                             "鎚鍔嬬擢鍍謄瞳瀞濡膿繁糞鮪麿儲" +
                             "優輿謡翼螺濫藍療瞭臨嶺齢聯藁儡" +
                             "簒燮嚀嚊嚏嚮壓壑壗壙嬲嬪嬶孺嶽" +
                             "嶷彌應懃懋懦戲擘擱擧擠擡擣擯擴" +
                             "擲斂斃曖曚朦檜檐檍檄檢檣檗檬檪" +
                             "歛歟氈濤澀濟濕濬濔濘濱濮瀁燬牆" +
                             "獰甕甓癇癈癆癘盪瞶磽磴礇齋禮穗" +
                             "穉邃簔簀簇簓簗簍篶簧糜總縱繆縻" +
                             "縵縹繃縷縲罅翳聳聲聰膾膸膽臀臂" +
                             "膺臉舊艝艚艱藉薺藏薹藐虧蟋螽蟀" +
                             "蟐雖螫蟄螳螻蠎襁襄褻襌覬覯謌謇" +
                             "謚謖謐謗謠謨譁豁谿貔貘賽賺賻贅" +
                             "蹊蹇蹌蹐蹈蹕轅轂輾邇邉醢鍜鍠鍼" +
                             "鍮鍖鎹闊濶闃闌隸襍鞜顆颶餬餽饂" +
                             "馘駻駸騁髀魏魍魎鮟鮠鮨鮴鵄鵁鴿" +
                             "鴾鵆鵈麋黏黜點黝黻鼾齔龜龠" +
                             "鵜" +
                             "鎧穫額顎鎌簡観顔騎襟謹顕験鯉鵠" +
                             "鎖藷擾穣織職髄雛蹟繕礎叢鎗騒臓" +
                             "題瀦鎮藤闘禰嚢藩謬覆癖鞭翻繭霧" +
                             "癒曜離糧雙嚠嚔壘彝懣懴戳擶擺擽" +
                             "攅斷旛曠檮櫁檻櫃櫂檸檳櫚歸殯瀉" +
                             "瀋濺瀑瀏濾燻燼燹燿獵璧瓊癜瞹瞿" +
                             "瞼瞽瞻矇礒礑穡穢竅竄簣簪簟繦繧" +
                             "繝繖繞繙繚羂羃翹聶臍臑艟藪藕藝" +
                             "藥藜蟯蟲蟠襠覲觴謳鞫謦謫謾豐贄" +
                             "蹙蹤蹠蹣躇轌轉轆邊醫醪釐鎰鎬鎭" +
                             "鎔鏈闕闔闖隴雜霤鞨鞦鞣鞳顏顋餮" +
                             "餾馥騏騅鬆鬩鯀鯊鮹鯆鯏鯑鯒鵝鵞" +
                             "鵤鵑鵐鵙麌黠鼕鼬" +
                             "鯵韻艶蟹巌贋" +
                             "願蟻鏡繰警鶏鯨鹸鯖璽識蹴瀬蘇藻" +
                             "贈騨鯛瀧寵懲鏑轍顛難覇曝爆簸瀕" +
                             "譜簿鵬鵡羅類麗簾櫓麓勸嚥嚴壞壜" +
                             "壟嬾寳廬懷懶攀櫞櫑櫟殱濳瀛瀚瀝" +
                             "瀘瀟爍牘犢獸獺瓣疆疇癡癢礦礪礙" +
                             "穩簷簫簽籀繹繪繩羆羹羶羸臘艤艢" +
                             "艨蘂藹蘊蘓蘋藾藺蘆蘢蠅蠏蠍蟾蟶" +
                             "蟷蠖襞襦襤襪覈譌譏譎證譖譛譚贊" +
                             "贇蹶蹲蹼軅轎辭醯鏖鏗鏨鏥鏘鏃鏝" +
                             "鏐鏤關霪鞴韜韲饉饅騙騷魑鯣鯢鯤" +
                             "鯔鯡鯲鯱鯰鵲鶉鶇鵯鵺麒麕麑靡黼" +
                             "馨鰍艦議競響饗懸護纂鐘譲醸籍" +
                             "鐙騰櫨魔耀蘭鰐嚶嚼壥壤孃孅孀寶" +
                             "巉巍廰懺懽攘曦朧蘗櫪蘖灌瀰瀾瀲" +
                             "爐犧獻瓏疉蘯矍礬礫竇籌籃籏糯糲" +
                             "繼繻纃繽辮繿罌譱聹臙臚蘚蘰蠣蠑" +
                             "蠕襭覺觸譫譟譬譯譴譽贏贍躁躅躄" +
                             "軆轗醵醴釋鐚鐔鐓鐃鐇鐐鐫鐡闡闥" +
                             "霰飄飃饐饋饑饒饌騫驀髏鬪鰕鰔鰉" +
                             "鰓鰌鰆鰈鰒鰊鰄鰛鰰鶫鶚鶤鶩鶻鹹" +
                             "黥黨齣齟齠齡" +
                             "鰯顧轟鐸鶴纏鰭躍" +
                             "鑓欄露儺儷儼囂囁囃囀囈屬廱懼懾" +
                             "攝攜曩霸權櫻欅櫺歡殲爛瓔癨癩癪" +
                             "癧禳竈籔籐籖纈纉續纐纎罍飜臟艪" +
                             "蠢蠡襯覽贐齎贓贔躋躊躑轜辯醺鐶" +
                             "鐵鐺鑁闢霹韃飆驅驂驃騾髓鬘鰮鰥" +
                             "鰤鰡鰲鶯鶲鷄鷁鶸鶺鷆鷏鷂麝黯齦" +
                             "齧" +
                             "鰻鰹鑑驚轡讃襲鱈灘聾儻竸囎" +
                             "巓巒巖彎懿攤灑疊癬龝穰竊籠籘籟" +
                             "鬻糴纒罎羇聽艫蘿蠧襴襷覿讀贖躓" +
                             "躔轢邏鑒鑄鑛霽霾顫饕驕驍髑體鬚" +
                             "鰺鱇鱆鰾鷙鷓黐齬齪龕" +
                             "讐鱒鱗麟" +
                             "鷲戀攪攣攫變欒癰籤籥纓纔纖罐蠱" +
                             "讌讎躙轣轤鑠鑢鑞鑚靆靨韈齏顯驛" +
                             "驗髞鬟魘鱚鷸鷦鷭鷯黴鼇" +
                             "鷺鷹囑" +
                             "囓攬癲矗籬羈艷蠶蠹衢觀讒讓讖讙" +
                             "軈釀鑪靄靈靂韆顰驟鬢鱠鱧鷽鹽黌" +
                             "鼈齷齲齶" +
                             "欝廳欖灣糶纛臠蠻覊躡" +
                             "鑰鑵靉顱鬣鱶" +
                             "矚讚躪釁鑷顴驢驥" +
                             "黶" +
                             "纜鑽鑼鑾顳驤驩鬮鱸黷" +
                             "欟钁" +
                             "鑿鸚鸛" +
                             "鬱驪" +
                             "爨驫鸞";
    
    public NameValidator(IStringLocalizer<Resource> localizer)
    {
        _localizer = localizer;
    }
    
    public string? ValidatePlayerName(string playerName)
    {
        return ValidateName(playerName, _localizer["validateplayername"]);
    }
    
    public string? ValidateTeamName(string teamName)
    {
        return ValidateName(teamName, _localizer["validatetriadteamname"]);
    }
    
    public string? ValidatePvPTeamName(string teamName)
    {
        return ValidateName(teamName, _localizer["validatepvpteamname"]);
    }
    
    public string? ValidateCustomizeMessage(string message)
    {
        return ValidateMessage(message, _localizer["validatemessage"]);
    }
    
    private String? ValidateName(string name, string errorMessagePart)
    {
        const string prePattern = @"^[ ";
        const string afterPattern = @"ぁ-んァ-ンｧ-ﾝﾞﾟa-zA-Z0-9ａ-ｚＡ-Ｚ０-９-_ー＜＞＋－＊÷＝；：←／＼＿｜・＠！？＆★（）＾◇∀Ξν×†ω♪♭#∞〆→↓↑％※ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩ☆◆\[\]「」『』【】]{1,12}$";
        const string pattern = prePattern + JpKanji + afterPattern;
        
        return name.Length switch
        {
            0 => errorMessagePart + $" {_localizer["validation_required"]}",
            > (int) NameLength.PlayerNameMaxLength => errorMessagePart + $" {_localizer["validate_length_1"]} 12 {_localizer["validate_length_2"]}",
            _ => !Regex.IsMatch(name, pattern) ? errorMessagePart + $" {_localizer["validation_invalidchar"]}" : null
        };
    }
    
    private String? ValidateMessage(string message, string errorMessagePart)
    {
        const string prePattern = @"^[ ";
        const string afterPattern = @"ぁ-んァ-ンｧ-ﾝﾞﾟa-zA-Z0-9ａ-ｚＡ-Ｚ０-９-_ー＜＞＋－＊÷＝；：←／＼＿｜・＠！？＆★（）＾◇∀Ξν×†ω♪♭#∞〆→↓↑％※ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩ☆◆\[\]「」『』【】]{1,10}$";
        const string pattern = prePattern + JpKanji + afterPattern;
        
        return message.Length switch
        {
            0 => null,
            > (int) NameLength.MessageMaxLength => errorMessagePart + $" {_localizer["validate_length_1"]} 10 {_localizer["validate_length_2"]}",
            _ => !Regex.IsMatch(message, pattern) ? errorMessagePart + $" {_localizer["validation_invalidchar"]}" : null
        };
    }
}